experiment/raw/recreate_run8_wrk_stdout.txt
Running 2m test @ http://192.168.49.2:30080/health
  2 threads and 4 connections
  Thread calibration: mean lat.: 2.707ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.388ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    80.43ms  369.04ms   2.66s    95.62%
    Req/Sec     2.64     20.92   666.00     98.16%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.90ms
 75.000%    4.14ms
 90.000%    6.36ms
 99.000%    2.21s 
 99.900%    2.44s 
 99.990%    2.66s 
 99.999%    2.66s 
100.000%    2.66s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.688     0.000000            1         1.00
       1.838     0.100000           55         1.11
       2.155     0.200000          110         1.25
       2.349     0.300000          165         1.43
       2.653     0.400000          221         1.67
       2.899     0.500000          275         2.00
       3.015     0.550000          302         2.22
       3.199     0.600000          329         2.50
       3.469     0.650000          357         2.86
       3.841     0.700000          384         3.33
       4.143     0.750000          411         4.00
       4.311     0.775000          425         4.44
       4.491     0.800000          439         5.00
       4.671     0.825000          455         5.71
       4.979     0.850000          466         6.67
       5.387     0.875000          480         8.00
       5.879     0.887500          487         8.89
       6.387     0.900000          494        10.00
       7.435     0.912500          501        11.43
       7.951     0.925000          507        13.33
       8.927     0.937500          514        16.00
      12.967     0.943750          518        17.78
     263.935     0.950000          521        20.00
     648.703     0.956250          525        22.86
    1062.911     0.962500          528        26.67
    1207.295     0.968750          531        32.00
    1449.983     0.971875          533        35.56
    1861.631     0.975000          535        40.00
    2002.943     0.978125          538        45.71
    2002.943     0.981250          538        53.33
    2003.967     0.984375          542        64.00
    2003.967     0.985938          542        71.11
    2003.967     0.987500          542        80.00
    2209.791     0.989062          543        91.43
    2209.791     0.990625          543       106.67
    2244.607     0.992188          544       128.00
    2248.703     0.992969          546       142.22
    2248.703     0.993750          546       160.00
    2248.703     0.994531          546       182.86
    2248.703     0.995313          546       213.33
    2248.703     0.996094          546       256.00
    2435.071     0.996484          547       284.44
    2435.071     0.996875          547       320.00
    2435.071     0.997266          547       365.71
    2435.071     0.997656          547       426.67
    2435.071     0.998047          547       512.00
    2660.351     0.998242          548       568.89
    2660.351     1.000000          548          inf
#[Mean    =       80.434, StdDeviation   =      369.042]
#[Max     =     2658.304, Total count    =          548]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  602 requests in 2.00m, 145.42KB read
  Non-2xx or 3xx responses: 19
Requests/sec:      5.02
Transfer/sec:      1.21KB