experiment/raw/recreate_run9_wrk_stdout.txt
Running 2m test @ http://192.168.49.2:30080/health
  2 threads and 4 connections
  Thread calibration: mean lat.: 4.058ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.012ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    62.43ms  312.76ms   2.73s    95.80%
    Req/Sec     2.63     21.10   500.00     98.23%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.76ms
 75.000%    4.52ms
 90.000%    5.99ms
 99.000%    2.01s 
 99.900%    2.24s 
 99.990%    2.73s 
 99.999%    2.73s 
100.000%    2.73s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.069     0.000000            1         1.00
       2.575     0.100000           55         1.11
       2.965     0.200000          111         1.25
       3.231     0.300000          165         1.43
       3.445     0.400000          220         1.67
       3.755     0.500000          274         2.00
       3.891     0.550000          302         2.22
       4.009     0.600000          330         2.50
       4.139     0.650000          357         2.86
       4.327     0.700000          384         3.33
       4.519     0.750000          411         4.00
       4.607     0.775000          425         4.44
       4.767     0.800000          439         5.00
       4.943     0.825000          453         5.71
       5.115     0.850000          466         6.67
       5.503     0.875000          480         8.00
       5.755     0.887500          487         8.89
       5.991     0.900000          494        10.00
       6.163     0.912500          501        11.43
       6.503     0.925000          507        13.33
       7.031     0.937500          514        16.00
       7.527     0.943750          518        17.78
       7.851     0.950000          521        20.00
     351.743     0.956250          525        22.86
     404.479     0.962500          528        26.67
     422.143     0.968750          531        32.00
    1203.199     0.971875          534        35.56
    1204.223     0.975000          535        40.00
    1215.487     0.978125          537        45.71
    1219.583     0.981250          538        53.33
    2001.919     0.984375          541        64.00
    2001.919     0.985938          541        71.11
    2002.943     0.987500          542        80.00
    2011.135     0.989062          544        91.43
    2011.135     0.990625          544       106.67
    2011.135     0.992188          544       128.00
    2015.231     0.992969          545       142.22
    2015.231     0.993750          545       160.00
    2016.255     0.994531          546       182.86
    2016.255     0.995313          546       213.33
    2016.255     0.996094          546       256.00
    2242.559     0.996484          547       284.44
    2242.559     0.996875          547       320.00
    2242.559     0.997266          547       365.71
    2242.559     0.997656          547       426.67
    2242.559     0.998047          547       512.00
    2729.983     0.998242          548       568.89
    2729.983     1.000000          548          inf
#[Mean    =       62.426, StdDeviation   =      312.761]
#[Max     =     2727.936, Total count    =          548]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  602 requests in 2.00m, 145.35KB read
  Non-2xx or 3xx responses: 18
Requests/sec:      5.02
Transfer/sec:      1.21KB