experiment/raw/rolling_run1_wrk_stdout.txt
Running 2m test @ http://192.168.49.2:30080/health
  2 threads and 4 connections
  Thread calibration: mean lat.: 3.316ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.172ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.21ms    6.17ms  60.35ms   97.81%
    Req/Sec     2.66     20.55   222.00     98.15%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.19ms
 75.000%    4.04ms
 90.000%    5.15ms
 99.000%   41.53ms
 99.900%   59.33ms
 99.990%   60.38ms
 99.999%   60.38ms
100.000%   60.38ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.121     0.000000            1         1.00
       2.061     0.100000           55         1.11
       2.373     0.200000          110         1.25
       2.617     0.300000          165         1.43
       2.883     0.400000          220         1.67
       3.187     0.500000          274         2.00
       3.351     0.550000          302         2.22
       3.547     0.600000          329         2.50
       3.677     0.650000          357         2.86
       3.847     0.700000          384         3.33
       4.039     0.750000          411         4.00
       4.135     0.775000          425         4.44
       4.287     0.800000          439         5.00
       4.519     0.825000          454         5.71
       4.695     0.850000          466         6.67
       4.895     0.875000          480         8.00
       4.971     0.887500          487         8.89
       5.175     0.900000          494        10.00
       5.403     0.912500          501        11.43
       5.627     0.925000          507        13.33
       5.883     0.937500          514        16.00
       6.191     0.943750          518        17.78
       6.663     0.950000          522        20.00
       6.891     0.956250          525        22.86
       7.131     0.962500          528        26.67
       7.343     0.968750          531        32.00
       8.179     0.971875          533        35.56
       9.095     0.975000          535        40.00
      10.895     0.978125          537        45.71
      28.831     0.981250          538        53.33
      33.183     0.984375          540        64.00
      34.847     0.985938          541        71.11
      36.735     0.987500          542        80.00
      41.535     0.989062          543        91.43
      41.535     0.990625          543       106.67
      54.143     0.992188          544       128.00
      55.935     0.992969          545       142.22
      55.935     0.993750          545       160.00
      56.831     0.994531          546       182.86
      56.831     0.995313          546       213.33
      56.831     0.996094          546       256.00
      59.327     0.996484          547       284.44
      59.327     0.996875          547       320.00
      59.327     0.997266          547       365.71
      59.327     0.997656          547       426.67
      59.327     0.998047          547       512.00
      60.383     0.998242          548       568.89
      60.383     1.000000          548          inf
#[Mean    =        4.211, StdDeviation   =        6.167]
#[Max     =       60.352, Total count    =          548]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  602 requests in 2.00m, 143.13KB read
  Non-2xx or 3xx responses: 4
Requests/sec:      5.02
Transfer/sec:      1.19KB